Ran Plan for dir: `0-bootstrap` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # google_billing_account_iam_member.tf_billing_admin will be created
+ resource "google_billing_account_iam_member" "tf_billing_admin" {
      + billing_account_id = "01A498-EAE05D-589783"
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/billing.admin"
    }

  # google_folder.bootstrap will be created
+ resource "google_folder" "bootstrap" {
      + create_time     = (known after apply)
      + display_name    = "fldr-bootstrap"
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + name            = (known after apply)
      + parent          = "organizations/172403920164"
    }

  # module.seed_bootstrap.google_billing_account_iam_member.tf_billing_user[0] will be created
+ resource "google_billing_account_iam_member" "tf_billing_user" {
      + billing_account_id = "01A498-EAE05D-589783"
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/billing.user"
    }

  # module.seed_bootstrap.google_organization_iam_binding.billing_creator will be created
+ resource "google_organization_iam_binding" "billing_creator" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "group:billing-admins@menubase.io",
        ]
      + org_id  = "172403920164"
      + role    = "roles/billing.creator"
    }

  # module.seed_bootstrap.google_organization_iam_binding.project_creator[0] will be created
+ resource "google_organization_iam_binding" "project_creator" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + org_id  = "172403920164"
      + role    = "roles/resourcemanager.projectCreator"
    }

  # module.seed_bootstrap.google_organization_iam_member.org_admin_serviceusage_consumer[0] will be created
+ resource "google_organization_iam_member" "org_admin_serviceusage_consumer" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "group:org-admins@menubase.io"
      + org_id = "172403920164"
      + role   = "roles/serviceusage.serviceUsageConsumer"
    }

  # module.seed_bootstrap.google_organization_iam_member.org_admins_group["roles/billing.user"] will be created
+ resource "google_organization_iam_member" "org_admins_group" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "group:org-admins@menubase.io"
      + org_id = "172403920164"
      + role   = "roles/billing.user"
    }

  # module.seed_bootstrap.google_organization_iam_member.org_admins_group["roles/resourcemanager.organizationAdmin"] will be created
+ resource "google_organization_iam_member" "org_admins_group" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "group:org-admins@menubase.io"
      + org_id = "172403920164"
      + role   = "roles/resourcemanager.organizationAdmin"
    }

  # module.seed_bootstrap.google_organization_iam_member.org_billing_admin will be created
+ resource "google_organization_iam_member" "org_billing_admin" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "group:billing-admins@menubase.io"
      + org_id = "172403920164"
      + role   = "roles/billing.admin"
    }

  # module.seed_bootstrap.google_organization_iam_member.tf_sa_org_perms["roles/accesscontextmanager.policyAdmin"] will be created
+ resource "google_organization_iam_member" "tf_sa_org_perms" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + org_id = "172403920164"
      + role   = "roles/accesscontextmanager.policyAdmin"
    }

  # module.seed_bootstrap.google_organization_iam_member.tf_sa_org_perms["roles/billing.user"] will be created
+ resource "google_organization_iam_member" "tf_sa_org_perms" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + org_id = "172403920164"
      + role   = "roles/billing.user"
    }

  # module.seed_bootstrap.google_organization_iam_member.tf_sa_org_perms["roles/compute.networkAdmin"] will be created
+ resource "google_organization_iam_member" "tf_sa_org_perms" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + org_id = "172403920164"
      + role   = "roles/compute.networkAdmin"
    }

  # module.seed_bootstrap.google_organization_iam_member.tf_sa_org_perms["roles/compute.xpnAdmin"] will be created
+ resource "google_organization_iam_member" "tf_sa_org_perms" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + org_id = "172403920164"
      + role   = "roles/compute.xpnAdmin"
    }

  # module.seed_bootstrap.google_organization_iam_member.tf_sa_org_perms["roles/iam.securityAdmin"] will be created
+ resource "google_organization_iam_member" "tf_sa_org_perms" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + org_id = "172403920164"
      + role   = "roles/iam.securityAdmin"
    }

  # module.seed_bootstrap.google_organization_iam_member.tf_sa_org_perms["roles/iam.serviceAccountAdmin"] will be created
+ resource "google_organization_iam_member" "tf_sa_org_perms" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + org_id = "172403920164"
      + role   = "roles/iam.serviceAccountAdmin"
    }

  # module.seed_bootstrap.google_organization_iam_member.tf_sa_org_perms["roles/logging.configWriter"] will be created
+ resource "google_organization_iam_member" "tf_sa_org_perms" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + org_id = "172403920164"
      + role   = "roles/logging.configWriter"
    }

  # module.seed_bootstrap.google_organization_iam_member.tf_sa_org_perms["roles/orgpolicy.policyAdmin"] will be created
+ resource "google_organization_iam_member" "tf_sa_org_perms" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + org_id = "172403920164"
      + role   = "roles/orgpolicy.policyAdmin"
    }

  # module.seed_bootstrap.google_organization_iam_member.tf_sa_org_perms["roles/resourcemanager.folderAdmin"] will be created
+ resource "google_organization_iam_member" "tf_sa_org_perms" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + org_id = "172403920164"
      + role   = "roles/resourcemanager.folderAdmin"
    }

  # module.seed_bootstrap.google_organization_iam_member.tf_sa_org_perms["roles/resourcemanager.organizationViewer"] will be created
+ resource "google_organization_iam_member" "tf_sa_org_perms" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + org_id = "172403920164"
      + role   = "roles/resourcemanager.organizationViewer"
    }

  # module.seed_bootstrap.google_organization_iam_member.tf_sa_org_perms["roles/resourcemanager.projectCreator"] will be created
+ resource "google_organization_iam_member" "tf_sa_org_perms" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + org_id = "172403920164"
      + role   = "roles/resourcemanager.projectCreator"
    }

  # module.seed_bootstrap.google_organization_iam_member.tf_sa_org_perms["roles/securitycenter.notificationConfigEditor"] will be created
+ resource "google_organization_iam_member" "tf_sa_org_perms" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + org_id = "172403920164"
      + role   = "roles/securitycenter.notificationConfigEditor"
    }

  # module.seed_bootstrap.google_organization_iam_member.tmp_project_creator[0] will be created
+ resource "google_organization_iam_member" "tmp_project_creator" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "group:org-admins@menubase.io"
      + org_id = "172403920164"
      + role   = "roles/resourcemanager.projectCreator"
    }

  # module.seed_bootstrap.google_service_account.org_terraform will be created
+ resource "google_service_account" "org_terraform" {
      + account_id   = "org-terraform"
      + display_name = "CFT Organization Terraform Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "cft-seed-9288"
      + unique_id    = (known after apply)
    }

  # module.seed_bootstrap.google_service_account_iam_member.org_admin_sa_impersonate_permissions[0] will be created
+ resource "google_service_account_iam_member" "org_admin_sa_impersonate_permissions" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "group:org-admins@menubase.io"
      + role               = "roles/iam.serviceAccountTokenCreator"
      + service_account_id = (known after apply)
    }

  # module.seed_bootstrap.google_storage_bucket.org_terraform_state will be created
+ resource "google_storage_bucket" "org_terraform_state" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-SOUTHEAST1"
      + name                        = "cft-tfstate-b7ef"
      + project                     = "cft-seed-9288"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = true
        }
    }

  # module.seed_bootstrap.google_storage_bucket_iam_member.org_terraform_state_iam will be created
+ resource "google_storage_bucket_iam_member" "org_terraform_state_iam" {
      + bucket = "cft-tfstate-b7ef"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.admin"
    }

  # module.seed_bootstrap.google_storage_bucket_iam_member.orgadmins_state_iam[0] will be created
+ resource "google_storage_bucket_iam_member" "orgadmins_state_iam" {
      + bucket = "cft-tfstate-b7ef"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "group:org-admins@menubase.io"
      + role   = "roles/storage.admin"
    }

  # module.seed_bootstrap.module.seed_project.module.project-factory.data.null_data_source.default_service_account will be read during apply
  # (config refers to values not yet known)
 <= data "null_data_source" "default_service_account"  {
      + has_computed_default = (known after apply)
      + id                   = (known after apply)
      + inputs               = {
          + "email" = (known after apply)
        }
      + outputs              = (known after apply)
      + random               = (known after apply)
    }

  # module.seed_bootstrap.module.seed_project.module.project-factory.google_project.main will be created
+ resource "google_project" "main" {
      + auto_create_network = false
      + billing_account     = "01A498-EAE05D-589783"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = {
          + "application_name"  = "seed-bootstrap"
          + "billing_code"      = "1234"
          + "business_code"     = "abcd"
          + "env_code"          = "b"
          + "environment"       = "bootstrap"
          + "primary_contact"   = "example1"
          + "secondary_contact" = "example2"
        }
      + name                = "cft-seed"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "cft-seed-9288"
      + skip_delete         = (known after apply)
    }

  # module.seed_bootstrap.module.seed_project.module.project-factory.google_service_account.default_service_account will be created
+ resource "google_service_account" "default_service_account" {
      + account_id   = "project-service-account"
      + display_name = "cft-seed Project Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "cft-seed-9288"
      + unique_id    = (known after apply)
    }

  # module.seed_bootstrap.module.seed_project.module.project-factory.module.gcloud_disable.null_resource.run_command[0] will be created
+ resource "null_resource" "run_command" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.seed_bootstrap.module.seed_project.module.project-factory.module.gcloud_disable.null_resource.run_destroy_command[0] will be created
+ resource "null_resource" "run_destroy_command" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["accesscontextmanager.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "cft-seed-9288"
      + service                    = "accesscontextmanager.googleapis.com"
    }

  # module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["admin.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "cft-seed-9288"
      + service                    = "admin.googleapis.com"
    }

  # module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["appengine.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "cft-seed-9288"
      + service                    = "appengine.googleapis.com"
    }

  # module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["bigquery.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "cft-seed-9288"
      + service                    = "bigquery.googleapis.com"
    }

  # module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["billingbudgets.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "cft-seed-9288"
      + service                    = "billingbudgets.googleapis.com"
    }

  # module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["cloudbilling.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "cft-seed-9288"
      + service                    = "cloudbilling.googleapis.com"
    }

  # module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["cloudresourcemanager.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "cft-seed-9288"
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "cft-seed-9288"
      + service                    = "compute.googleapis.com"
    }

  # module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["iam.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "cft-seed-9288"
      + service                    = "iam.googleapis.com"
    }

  # module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["iamcredentials.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "cft-seed-9288"
      + service                    = "iamcredentials.googleapis.com"
    }

  # module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["logging.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "cft-seed-9288"
      + service                    = "logging.googleapis.com"
    }

  # module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["monitoring.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "cft-seed-9288"
      + service                    = "monitoring.googleapis.com"
    }

  # module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["pubsub.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "cft-seed-9288"
      + service                    = "pubsub.googleapis.com"
    }

  # module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["securitycenter.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "cft-seed-9288"
      + service                    = "securitycenter.googleapis.com"
    }

  # module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["servicenetworking.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "cft-seed-9288"
      + service                    = "servicenetworking.googleapis.com"
    }

  # module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["serviceusage.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "cft-seed-9288"
      + service                    = "serviceusage.googleapis.com"
    }

  # module.seed_bootstrap.module.seed_project.module.project-factory.module.project_services.google_project_service.project_services["storage-api.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "cft-seed-9288"
      + service                    = "storage-api.googleapis.com"
    }

Plan: 48 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ gcs_bucket_tfstate = "cft-tfstate-b7ef"
+ seed_project_id    = "cft-seed-9288"
+ terraform_sa_email = (known after apply)
+ terraform_sa_name  = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d 0-bootstrap`
* :put_litter_in_its_place: To **delete** this plan click [here](http://206.189.47.123/lock?id=WJay-tec%252Fbootstrap_atlantis%252F0-bootstrap%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d 0-bootstrap`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
